package lesson_8;

public class Main {
    public static void main(String[] args) {
        // 1. Создать класс игру, в которой у нас происходит игра.
        // 2. Создаем игроков.
        // 3. Создаем крупье.
        // 4. Добавить игроков и крупье в игру.
        // 5. Добавить колоду карт.
        // 6. Добавить карты в колоду.
        // 7. Раздать каждоиму игроку по 2 карты на старте.
        // 8. Раздавать каждому игроку по одной карте, пока это требуется.
        // 9. Определить победителя.

    }
}
